billing_cf/Documents/энргРегистрацияПоказанийАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргРегистрацияПоказанийАбонента</Name>
			<BasedOn>
				<xr:Item>Document.энргПриходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргЗарегистрированныйОбъемПриборов</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьэнргИндивидуальныйОбъемДляОДН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргЗагрузкаПоказанийИзВнешнихИсточников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргЗагрузкаДанныхИзВнешнихИсточников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргМассовыйВводПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоказаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьУслуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

billing_cf/CommonModules/MAXBotИнтеграция/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ЗарегистрироватьПользователя(MAXUserID, ChatID, Имя) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Пользователи.Ссылка КАК Ссылка ИЗ Справочник.MAXBotПользователи КАК Пользователи ГДЕ Пользователи.MAXUserID = &MAXUserID");
	Запрос.УстановитьПараметр("MAXUserID", MAXUserID);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе Объект = Справочники.MAXBotПользователи.СоздатьЭлемент();
		Объект.MAXUserID = MAXUserID; КонецЕсли;
	Объект.ChatID = ChatID;
	Если Не ПустаяСтрока(Имя) Тогда
		Объект.ИмяMAX = Имя;
	КонецЕсли;
	Объект.Записать();
	Возврат Объект.Ссылка;
КонецФункции

Функция ПроверитьАвторизацию(Запрос) Экспорт
	Заголовок = Запрос.Заголовки.Получить("Authorization");
	Если ПустаяСтрока(Заголовок) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Заголовок = "Bearer " + Константы.MAXBotToken.Получить();
КонецФункции

Функция ЗафиксироватьСогласие(MAXUserID, ВерсияСогласия, Источник = "") Экспорт
	Пользователь = НайтиИлиСоздатьПользователя(MAXUserID);
	ЗаписатьИсториюПользователя(MAXUserID, "consent", "", ВерсияСогласия, Источник);
	Возврат Истина;
КонецФункции

Функция НачатьПривязкуЛицевогоСчета(MAXUserID, НомерЛицевогоСчета, Источник = "") Экспорт
	ЛицевойСчет = НайтиЛицевойСчетПоНомеру(НомерЛицевогоСчета);
	Результат = Новый Структура("Успех,Код", ЛицевойСчет <> Неопределено, "");
	Если ЛицевойСчет = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	Код = СгенерироватьКодПодтверждения();
	Если MAXBotРазрешитьТестовыйКод() Тогда
		Код = "1234";
	КонецЕсли;
	ЗаписатьИсториюПользователя(MAXUserID, "link_code", Строка(ЛицевойСчет.УникальныйИдентификатор()), ХешСтроки(Код), Формат(ТекущаяДата() + 600, "ДФ=yyyy-MM-dd HH:mm:ss"));
	// TODO: отправить Код штатным SMS/e-mail механизмом конфигурации. Код не возвращается в HTTP-ответ.
	Возврат Результат;
КонецФункции

Функция ПодтвердитьПривязкуЛицевогоСчета(MAXUserID, НомерЛицевогоСчета, Код, Источник = "") Экспорт
	ЛицевойСчет = НайтиЛицевойСчетПоНомеру(НомерЛицевогоСчета);
	Если ЛицевойСчет = Неопределено Тогда
		Возврат Новый Структура("КодОшибки,ЛицевойСчет", "ACCOUNT_NOT_FOUND", Неопределено);
	КонецЕсли;
	Если Не ПроверитьКодПривязки(MAXUserID, ЛицевойСчет, Код) Тогда
		Возврат Новый Структура("КодОшибки,ЛицевойСчет", "INVALID_CODE", Неопределено);
	КонецЕсли;
	ЗаписатьИсториюПользователя(MAXUserID, "account_link", Строка(ЛицевойСчет.УникальныйИдентификатор()), НомерЛицевогоСчета, Источник);
	Возврат Новый Структура("КодОшибки,ЛицевойСчет", "", ЛицевойСчет);
КонецФункции

Функция JSONЛицевойСчет(ЛицевойСчет) Экспорт
	Данные = Новый Структура;
	Данные.Вставить("account_id", Строка(ЛицевойСчет.УникальныйИдентификатор()));
	Данные.Вставить("number", Строка(ЛицевойСчет.Код));
	Данные.Вставить("address", Строка(ЛицевойСчет));
	Данные.Вставить("is_active", Не ЛицевойСчет.ПометкаУдаления);
	Возврат Данные;
КонецФункции

Функция ПолучитьЛицевыеСчетаПользователяJSON(MAXUserID) Экспорт
	Массив = Новый Массив;
	Для Каждого AccountID Из ПолучитьAccountIDПользователя(MAXUserID) Цикл
		ЛС = ПолучитьЛицевойСчетПоAccountID(AccountID);
		Если ЛС <> Неопределено Тогда Массив.Добавить(JSONЛицевойСчет(ЛС)); КонецЕсли;
	КонецЦикла;
	Возврат Массив;
КонецФункции

Функция ПользовательИмеетДоступКЛС(MAXUserID, AccountID) Экспорт
	// TODO MAXBot DB: критическая заглушка — вручную реализовать проверку связи MAX-пользователя и лицевого счета в базе 1С.
	Возврат Истина;
КонецФункции

Функция ПолучитьБалансJSON(AccountID) Экспорт
	ЛС = ПолучитьЛицевойСчетПоAccountID(AccountID);
	ДанныеНачислений = ПолучитьПоследниеНачисленияТарифыУслуги(ЛС);
	Данные = Новый Структура;
	Данные.Вставить("account_id", AccountID);
	Данные.Вставить("debt", ДанныеНачислений.debt);
	Данные.Вставить("overpay", ДанныеНачислений.overpay);
	Данные.Вставить("currency", ДанныеНачислений.currency);
	Данные.Вставить("actual_at", ДанныеНачислений.actual_at);
	Возврат Данные;
КонецФункции

Функция GetBalance(MAXUserID, AccountID) Экспорт
	Если Не ПользовательИмеетДоступКЛС(MAXUserID, AccountID) Тогда
		Возврат Новый Структура("success,code,message,data", Ложь, "FORBIDDEN", "Нет доступа к лицевому счету", Новый Структура);
	КонецЕсли;
	Возврат Новый Структура("success,code,message,data", Истина, "OK", "Баланс", ПолучитьБалансJSON(AccountID));
КонецФункции

Функция ПолучитьПоследниеНачисленияТарифыУслуги(ЛицевойСчет, Период = Неопределено) Экспорт
	Если Период = Неопределено Тогда
		Период = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Данные = Новый Структура("Долг,Переплата,Период,Начислено,Оплачено,Услуги,Тарифы,Начисления,debt,overpay,currency,actual_at", 0, 0, Формат(Период, "ДФ=yyyy-MM"), 0, 0, Новый Массив, Новый Массив, Новый Массив, 0, 0, "руб.", Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd"));
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъемНачислений.Услуга КАК Услуга,
	|	ОбъемНачислений.Измеритель КАК Измеритель,
	|	ОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	ОбъемНачислений.Шкала КАК Шкала,
	|	ОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	МАКСИМУМ(ОбъемНачислений.Период) КАК Период,
	|	СУММА(ОбъемНачислений.ОбъемУслуги) КАК Объем,
	|	СУММА(ОбъемНачислений.Сумма) КАК Сумма
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК ОбъемНачислений
	|ГДЕ
	|	ОбъемНачислений.Абонент = &ЛицевойСчет
	|	И ОбъемНачислений.ПериодНачисления = &Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Услуга,
	|	ОбъемНачислений.Измеритель,
	|	ОбъемНачислений.ТочкаУчета,
	|	ОбъемНачислений.ПриборУчета,
	|	ОбъемНачислений.Шкала,
	|	ОбъемНачислений.ТарифнаяЗона,
	|	ОбъемНачислений.ЗначениеТарифа,
	|	ОбъемНачислений.ПериодНачисления";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Возврат Данные;
	КонецПопытки;
	Пока Выборка.Следующий() Цикл
		Услуга = Новый Структура;
		Услуга.Вставить("service_id", UIDСтрокой(Выборка.Услуга));
		Услуга.Вставить("service_name", ПредставлениеБезMock(Выборка.Услуга));
		Услуга.Вставить("resource", ПредставлениеБезMock(Выборка.Измеритель));
		Услуга.Вставить("tariff_id", UIDСтрокой(Выборка.ЗначениеТарифа));
		Услуга.Вставить("tariff_name", ПредставлениеБезMock(Выборка.ЗначениеТарифа));
		Услуга.Вставить("unit", ПредставлениеБезMock(Выборка.Измеритель));
		Услуга.Вставить("volume", Выборка.Объем);
		Услуга.Вставить("amount", Выборка.Сумма);
		Услуга.Вставить("period", Формат(Выборка.ПериодНачисления, "ДФ=yyyy-MM-dd"));
		Услуга.Вставить("meter_ref", Выборка.ПриборУчета);
		Услуга.Вставить("point_ref", Выборка.ТочкаУчета);
		Данные.Услуги.Добавить(Услуга);
		Данные.Начислено = Данные.Начислено + Выборка.Сумма;
	КонецЦикла;
	Возврат Данные;
КонецФункции

Функция ПолучитьПриборыУчетаJSON(AccountID, MAXUserID = Неопределено) Экспорт
	ЛС = ПолучитьЛицевойСчетПоAccountID(AccountID);
	Возврат ПолучитьПриборыУчета(ЛС);
КонецФункции

Функция ПолучитьПриборыУчета(ЛицевойСчет) Экспорт
	Возврат ПолучитьТочкиПередачиПоказаний(ЛицевойСчет);
КонецФункции

Функция ПолучитьТочкиПередачиПоказаний(ЛицевойСчет, Период = Неопределено) Экспорт
	Массив = Новый Массив;
	Начисления = ПолучитьПоследниеНачисленияТарифыУслуги(ЛицевойСчет, Период);
	Для Каждого СтрокаУслуги Из Начисления.Услуги Цикл
		Данные = Новый Структура;
		Прибор = СтрокаУслуги.meter_ref;
		ЕстьПрибор = ЗначениеЗаполнено(Прибор);
		Данные.Вставить("meter_id", ?(ЕстьПрибор, UIDСтрокой(Прибор), ""));
		Данные.Вставить("display_name", СформироватьDisplayName(СтрокаУслуги));
		Данные.Вставить("resource", СтрокаУслуги.resource);
		Данные.Вставить("service_id", СтрокаУслуги.service_id);
		Данные.Вставить("service_name", СтрокаУслуги.service_name);
		Данные.Вставить("tariff_id", СтрокаУслуги.tariff_id);
		Данные.Вставить("tariff_name", СтрокаУслуги.tariff_name);
		Данные.Вставить("unit", СтрокаУслуги.unit);
		Данные.Вставить("serial_number", ?(ЕстьПрибор, Строка(Прибор.Код), ""));
		Последнее = ПолучитьПоследнееПоказаниеПрибора(Прибор);
		Данные.Вставить("last_value", Последнее.Показание);
		Данные.Вставить("last_reading_date", Последнее.Дата);
		Данные.Вставить("verification_to", "");
		Данные.Вставить("can_submit", ЕстьПрибор);
		Данные.Вставить("reason", ?(ЕстьПрибор, "", "Не найден прибор учета для передачи показаний"));
		Массив.Добавить(Данные);
	КонецЦикла;
	Возврат Массив;
КонецФункции

Функция СоздатьПоказаниеПрибора(AccountID, MeterID, Период, Значение, Источник, MAXUserID, MessageID, OperationID) Экспорт
	Если ОперацияУжеВыполнена(OperationID) Тогда
		Возврат ПолучитьРезультатОперацииJSON(OperationID);
	КонецЕсли;
	Если Не ПользовательИмеетДоступКЛС(MAXUserID, AccountID) Тогда
		ВызватьИсключение "FORBIDDEN";
	КонецЕсли;

	ЛицевойСчет = ПолучитьЛицевойСчетПоAccountID(AccountID);
	ТочкаПоказаний = НайтиТочкуПередачиПоказанийДляЗаписи(ЛицевойСчет, MeterID, Период);
	Если ТочкаПоказаний = Неопределено Тогда
		Если ЗначениеЗаполнено(ПолучитьПриборУчетаПоMeterID(MeterID)) Тогда
			Возврат Новый Структура("success,code,message,data", Ложь, "ACCESS_DENIED", "Прибор учета не принадлежит лицевому счету", Новый Структура);
		КонецЕсли;
		Возврат Новый Структура("success,code,message,data", Ложь, "METER_NOT_FOUND", "Точка передачи показаний не найдена", Новый Структура);
	КонецЕсли;

	Если Не ТочкаПоказаний.МожноПередавать Тогда
		Возврат Новый Структура("success,code,message,data", Ложь, "READING_NOT_ALLOWED", ТочкаПоказаний.ПричинаЗапрета, Новый Структура);
	КонецЕсли;

	ИсточникПоказаний = ПолучитьИсточникПоказанийMAX();
	Если Не ЗначениеЗаполнено(ИсточникПоказаний) Тогда
		Возврат Новый Структура("success,code,message,data", Ложь, "CONFIG_REQUIRED", "Не настроен источник показаний MAX", Новый Структура);
	КонецЕсли;

	Док = Документы.энргРегистрацияПоказанийАбонента.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Абонент = ТочкаПоказаний.Абонент;
	Док.КлючПомещения = ТочкаПоказаний.КлючПомещения;
	Док.Организация = ТочкаПоказаний.Организация;
	Док.Район = ТочкаПоказаний.Район;
	Док.ПериодНачисления = ПреобразоватьПериодMAX(Период);
	Док.ИсточникПоказаний = ИсточникПоказаний;
	Док.Примечание = "MAX; operation_id=" + OperationID + "; message_id=" + MessageID;

	IDТочки = Новый УникальныйИдентификатор();
	СтрокаТочки = Док.ТочкиУчета.Добавить();
	СтрокаТочки.IDСтроки = IDТочки;
	СтрокаТочки.ТочкаУчета = ТочкаПоказаний.ТочкаУчета;
	СтрокаТочки.Услуга = ТочкаПоказаний.Услуга;
	СтрокаТочки.ПриборУчета = ТочкаПоказаний.ПриборУчета;

	IDШкалы = Новый УникальныйИдентификатор();
	СтрокаШкалы = Док.ШкалыПриборовУчета.Добавить();
	СтрокаШкалы.IDСтроки = IDШкалы;
	СтрокаШкалы.IDСтрокиТочкиУчета = IDТочки;
	СтрокаШкалы.Шкала = ТочкаПоказаний.Шкала;
	УстановитьРеквизитЕслиЕсть(СтрокаШкалы, "ВидДифференцированности", ТочкаПоказаний.ВидДифференцированности);

	ПредыдущиеПоказания = ТочкаПоказаний.ПредыдущиеПоказания;
	Если ТочкаПоказаний.РегистрируетОбъем Тогда
		Разница = Значение;
		ТекущиеПоказания = ПредыдущиеПоказания + Значение;
	Иначе
		ТекущиеПоказания = Значение;
		Разница = Значение - ПредыдущиеПоказания;
	КонецЕсли;

	СтрокаПоказаний = Док.ПоказанияПриборовУчета.Добавить();
	СтрокаПоказаний.IDСтроки = IDШкалы;
	СтрокаПоказаний.ПредыдущиеПоказания = ПредыдущиеПоказания;
	СтрокаПоказаний.ТекущиеПоказания = ТекущиеПоказания;
	СтрокаПоказаний.Разница = Разница;
	СтрокаПоказаний.ПоказанияПредоставлены = Истина;
	УстановитьРеквизитЕслиЕсть(СтрокаПоказаний, "ДатаПоследнихПоказаний", ТочкаПоказаний.ДатаПоследнихПоказаний);
	УстановитьРеквизитЕслиЕсть(СтрокаПоказаний, "ТарифнаяЗона", ТочкаПоказаний.ТарифнаяЗона);
	УстановитьРеквизитЕслиЕсть(СтрокаПоказаний, "СостояниеПоказаний", ПолучитьСостояниеПоказанийMAX());
	УстановитьРеквизитЕслиЕсть(СтрокаПоказаний, "СтатусИзмененПользователем", Истина);
	УстановитьРеквизитЕслиЕсть(СтрокаПоказаний, "Переворот", Ложь);
	УстановитьРеквизитЕслиЕсть(СтрокаПоказаний, "ПереворотИзмененПользователем", Ложь);

	Док.Записать(РежимЗаписиДокумента.Запись);

	Данные = Новый Структура;
	Данные.Вставить("document_number", Док.Номер);
	Данные.Вставить("document_date", Формат(Док.Дата, "ДФ=yyyy-MM-dd"));
	Данные.Вставить("document_ref", Строка(Док.Ссылка.УникальныйИдентификатор()));
	Данные.Вставить("posted", Ложь);
	Данные.Вставить("meter_id", MeterID);
	Данные.Вставить("value", Значение);
	Данные.Вставить("status", "saved_unposted");

	Результат = Новый Структура("success,code,message,data", Истина, "OK", "Показание зарегистрировано", Данные);
	ЗапомнитьРезультатОперации(OperationID, "reading", Результат);
	Возврат Результат;
КонецФункции

Функция НайтиТочкуПередачиПоказанийДляЗаписи(ЛицевойСчет, MeterID, Период = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(ЛицевойСчет) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Период = Неопределено Тогда
		Период = НачалоМесяца(ТекущаяДата());
	Иначе
		Период = ПреобразоватьПериодMAX(Период);
	КонецЕсли;
	ПриборУчета = ПолучитьПриборУчетаПоMeterID(MeterID);
	Если Не ЗначениеЗаполнено(ПриборУчета) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.Район КАК Район,
	|	ОбъемНачислений.КлючПомещения КАК КлючПомещения,
	|	ОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемНачислений.Услуга КАК Услуга,
	|	ОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	ОбъемНачислений.Шкала КАК Шкала,
	|	ОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	ОбъемНачислений.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК ОбъемНачислений
	|ГДЕ
	|	ОбъемНачислений.Абонент = &ЛицевойСчет
	|	И ОбъемНачислений.ПериодНачисления = &Период
	|	И ОбъемНачислений.ПриборУчета = &ПриборУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъемНачислений.Период УБЫВ";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);

	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Последнее = ПолучитьПоследнееПоказаниеПрибора(Выборка.ПриборУчета);
	Результат = Новый Структура;
	Результат.Вставить("Абонент", Выборка.Абонент);
	Результат.Вставить("КлючПомещения", Выборка.КлючПомещения);
	Результат.Вставить("Организация", Выборка.Организация);
	Результат.Вставить("Район", Выборка.Район);
	Результат.Вставить("ТочкаУчета", Выборка.ТочкаУчета);
	Результат.Вставить("Услуга", Выборка.Услуга);
	Результат.Вставить("ПриборУчета", Выборка.ПриборУчета);
	Результат.Вставить("Шкала", Выборка.Шкала);
	Результат.Вставить("ТарифнаяЗона", Выборка.ТарифнаяЗона);
	Результат.Вставить("ВидДифференцированности", Выборка.ВидДифференцированности);
	Результат.Вставить("ПредыдущиеПоказания", Последнее.Показание);
	Результат.Вставить("ДатаПоследнихПоказаний", ПреобразоватьДатуMAX(Последнее.Дата));
	Результат.Вставить("РегистрируетОбъем", Выборка.РегистрируетОбъем);
	Результат.Вставить("МожноПередавать", ЗначениеЗаполнено(Выборка.ПриборУчета));
	Результат.Вставить("ПричинаЗапрета", ?(ЗначениеЗаполнено(Выборка.ПриборУчета), "", "Не найден прибор учета для передачи показаний"));
	Возврат Результат;
КонецФункции

Функция СоздатьОбращение(AccountID, MAXUserID, Category, ТекстОбращения, Источник, MessageID, OperationID) Экспорт
	Если ОперацияУжеВыполнена(OperationID) Тогда Возврат ПолучитьРезультатОперацииJSON(OperationID); КонецЕсли;
	Если Не ПользовательИмеетДоступКЛС(MAXUserID, AccountID) Тогда ВызватьИсключение "FORBIDDEN"; КонецЕсли;
	// TODO MAXBot DB: вручную реализовать создание документа/справочника обращения в базе 1С и заполнение номера, статуса и SLA.
	Данные = Новый Структура;
	Данные.Вставить("appeal_id", OperationID);
	Данные.Вставить("number", "MAX-" + OperationID);
	Данные.Вставить("status", "registered");
	Данные.Вставить("sla", "");
	Возврат Данные;
КонецФункции

Функция СоздатьЗаписьНаПрием(AccountID, MAXUserID, TopicID, Источник, OperationID) Экспорт
	Если ОперацияУжеВыполнена(OperationID) Тогда Возврат ПолучитьРезультатОперацииJSON(OperationID); КонецЕсли;
	Если Не ПользовательИмеетДоступКЛС(MAXUserID, AccountID) Тогда ВызватьИсключение "FORBIDDEN"; КонецЕсли;
	// TODO MAXBot DB: вручную реализовать создание записи на прием в объекте 1С расписания/заявок.
	Данные = Новый Структура;
	Данные.Вставить("appointment_id", OperationID);
	Данные.Вставить("number", "MAX-" + OperationID);
	Данные.Вставить("topic_title", TopicID);
	Данные.Вставить("office_address", "");
	Данные.Вставить("starts_at", "");
	Данные.Вставить("status", "created");
	Возврат Данные;
КонецФункции

Функция CreateAppointment(AccountID, MAXUserID, TopicID, Источник, OperationID) Экспорт
	Возврат СоздатьЗаписьНаПрием(AccountID, MAXUserID, TopicID, Источник, OperationID);
КонецФункции

Функция ПолучитьОтключенияJSON(AccountID, MAXUserID) Экспорт
	// TODO MAXBot DB: вручную реализовать выборку плановых/аварийных отключений по лицевому счету и адресу из базы 1С.
	Возврат Новый Массив;
КонецФункции

Функция GetOutages(MAXUserID, AccountID) Экспорт
	Возврат ПолучитьОтключенияJSON(AccountID, MAXUserID);
КонецФункции


Функция ПолучитьСправкуJSON() Экспорт
	// TODO MAXBot DB: вручную перенести текст справки в константу/настройку 1С при необходимости.
	Данные = Новый Структура;
	Данные.Вставить("text", "Команды: /start, согласен, привязать <номер ЛС>, баланс, показания, обращение <текст>.");
	Возврат Данные;
КонецФункции

Функция ПолучитьОрганизациюJSON() Экспорт
	// TODO MAXBot DB: вручную реализовать чтение реквизитов организации из справочника/констант 1С.
	Возврат Новый Структура("name,phone,email,site,work_hours,office_address,customer_service_hours", "", "", "", "", "", "", "");
КонецФункции

Функция ПолучитьАварийнуюСлужбуJSON() Экспорт
	// TODO MAXBot DB: вручную реализовать чтение телефонов аварийных служб из справочника/констант 1С.
	Возврат Новый Структура("dispatcher_phone,emergency_phone,gas_phone,electricity_phone,comment", "", "", "", "", "");
КонецФункции

Функция ПолучитьКвитанциюJSON(AccountID, Период, MAXUserID) Экспорт
	// TODO MAXBot DB: вручную реализовать поиск квитанции/начисления за период и формирование download_url штатным механизмом 1С.
	Возврат Новый Структура("account_id,period,amount,currency,document_number,document_date,download_url", AccountID, Период, 0, "руб.", "", "", "");
КонецФункции

Функция СоздатьСсылкуОплаты(AccountID, MAXUserID, Источник, OperationID, ReturnURL) Экспорт
	Если ОперацияУжеВыполнена(OperationID) Тогда Возврат ПолучитьРезультатОперацииJSON(OperationID); КонецЕсли;
	// TODO MAXBot DB: вручную реализовать создание платежной ссылки через платежный модуль/эквайринг 1С.
	Возврат Новый Структура("account_id,amount,currency,payment_url,expires_at", AccountID, 0, "руб.", ReturnURL, Формат(ТекущаяДата() + 3600, "ДФ=yyyy-MM-dd HH:mm:ss"));
КонецФункции

Функция ПолучитьТемыЗаписиJSON() Экспорт
	// TODO MAXBot DB: вручную реализовать чтение тем записи на прием из справочника/настройки 1С.
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("topic_id,title", "general", "Общий вопрос"));
	Возврат Массив;
КонецФункции

Функция ОперацияУжеВыполнена(OperationID) Экспорт
	Если ПустаяСтрока(OperationID) Тогда Возврат Ложь; КонецЕсли;
	Возврат ПолучитьРезультатОперацииJSON(OperationID).Количество() > 0;
КонецФункции

Функция ПолучитьРезультатОперацииJSON(OperationID) Экспорт
	Возврат ПолучитьИзИсторииОпераций(OperationID);
КонецФункции

Процедура ЗапомнитьРезультатОперации(OperationID, OperationType, Данные) Экспорт
	Если ПустаяСтрока(OperationID) Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьИсториюПользователя(0, "operation:" + OperationType, OperationID, JSONСтрока(Данные), "OK");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция MAXBotРазрешитьТестовыйКод()
	Попытка
		Возврат Константы.MAXBotРазрешитьТестовыйКод.Получить();
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция НайтиЛицевойСчетПоНомеру(Номер)
	Ссылка = Справочники.энргАбоненты.НайтиПоКоду(Номер);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПолучитьЛицевойСчетПоAccountID(AccountID)
	UID = Новый УникальныйИдентификатор(AccountID);
	Возврат Справочники.энргАбоненты.ПолучитьСсылку(UID);
КонецФункции

Функция ПолучитьПриборУчетаПоMeterID(MeterID)
	Если ПустаяСтрока(MeterID) Тогда
		Возврат Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();
	КонецЕсли;
	Попытка
		ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(MeterID));
	Исключение
		Возврат Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();
	КонецПопытки;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Приборы.Ссылка КАК Ссылка ИЗ Справочник.энргПриборыУчетаАбонента КАК Приборы ГДЕ Приборы.Ссылка = &ПриборУчета");
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Попытка
		Если Не Запрос.Выполнить().Пустой() Тогда
			Возврат ПриборУчета;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();
КонецФункции

Функция ПреобразоватьПериодMAX(Период)
	Если ТипЗнч(Период) = Тип("Дата") Тогда Возврат НачалоМесяца(Период); КонецЕсли;
	ПериодСтрокой = Строка(Период);
	Если ПустаяСтрока(ПериодСтрокой) Тогда Возврат НачалоМесяца(ТекущаяДата()); КонецЕсли;
	Год = Число(Лев(ПериодСтрокой, 4));
	Месяц = ?(СтрДлина(ПериодСтрокой) >= 7, Число(Сред(ПериодСтрокой, 6, 2)), Месяц(ТекущаяДата()));
	Возврат Дата(Год, Месяц, 1);
КонецФункции

Функция ПреобразоватьДатуMAX(ДатаСтрокой)
	Если ТипЗнч(ДатаСтрокой) = Тип("Дата") Тогда Возврат ДатаСтрокой; КонецЕсли;
	ДатаСтрокой = Строка(ДатаСтрокой);
	Если ПустаяСтрока(ДатаСтрокой) Тогда Возврат Дата(1, 1, 1); КонецЕсли;
	Попытка
		Возврат Дата(Число(Лев(ДатаСтрокой, 4)), Число(Сред(ДатаСтрокой, 6, 2)), Число(Сред(ДатаСтрокой, 9, 2)));
	Исключение
		Возврат Дата(1, 1, 1);
	КонецПопытки;
КонецФункции

Функция ПолучитьИсточникПоказанийMAX()
	Источник = Справочники.энргИсточникиПоказаний.НайтиПоНаименованию("MAX");
	Если ЗначениеЗаполнено(Источник) Тогда Возврат Источник; КонецЕсли;
	Источник = Справочники.энргИсточникиПоказаний.НайтиПоНаименованию("МАХ");
	Если ЗначениеЗаполнено(Источник) Тогда Возврат Источник; КонецЕсли;
	Возврат Справочники.энргИсточникиПоказаний.ПустаяСсылка();
КонецФункции

Функция ПолучитьСостояниеПоказанийMAX()
	Возврат Неопределено;
КонецФункции

Процедура УстановитьРеквизитЕслиЕсть(Объект, ИмяРеквизита, Значение)
	Если Значение = Неопределено Тогда Возврат; КонецЕсли;
	Попытка
		Если Объект.Метаданные().Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
			ДанныеЗаполнения = Новый Структура(ИмяРеквизита, Значение);
			ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения);
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьAccountIDПользователя(MAXUserID)
	Массив = Новый Массив;
	Запрос = Новый Запрос("ВЫБРАТЬ История.AccountID КАК AccountID ИЗ Справочник.MAXBotИсторияДанныхПользователей КАК История ГДЕ История.MAXUserID = &MAXUserID И История.ТипДанных = &Тип");
	Запрос.УстановитьПараметр("MAXUserID", MAXUserID);
	Запрос.УстановитьПараметр("Тип", "account_link");
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Возврат Массив;
	КонецПопытки;
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.AccountID);
	КонецЦикла;
	Возврат Массив;
КонецФункции

Функция НайтиИлиСоздатьПользователя(MAXUserID)
	Возврат ЗарегистрироватьПользователя(MAXUserID, 0, "");
КонецФункции

Процедура ЗаписатьИсториюПользователя(MAXUserID, ТипДанных, AccountID, Значение, Статус)
	Попытка
		Объект = Справочники.MAXBotИсторияДанныхПользователей.СоздатьЭлемент();
		Объект.MAXUserID = MAXUserID;
		Объект.ТипДанных = ТипДанных;
		Объект.AccountID = AccountID;
		Объект.ДанныеJSON = Значение;
		Объект.Статус = Статус;
		Объект.Записать();
	Исключение
		// История операций обязательна в расширении MAX; если объект не установлен, операции не должны маскироваться mock-ответами.
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьИзИсторииОпераций(OperationID)
	Результат = Новый Структура;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 История.ДанныеJSON КАК ДанныеJSON ИЗ Справочник.MAXBotИсторияДанныхПользователей КАК История ГДЕ История.AccountID = &OperationID И История.ТипДанных ПОДОБНО &Тип");
	Запрос.УстановитьПараметр("OperationID", OperationID);
	Запрос.УстановитьПараметр("Тип", "operation:%");
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Возврат Результат;
	КонецПопытки;
	Если Выборка.Следующий() Тогда
		Возврат JSONВСтруктуру(Выборка.ДанныеJSON);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ПриборПринадлежитЛС(MeterID, AccountID)
	ЛС = ПолучитьЛицевойСчетПоAccountID(AccountID);
	Для Каждого Точка Из ПолучитьТочкиПередачиПоказаний(ЛС) Цикл Если Точка.meter_id = MeterID И Точка.can_submit Тогда Возврат Истина; КонецЕсли; КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция UIDСтрокой(Значение)
	Если Не ЗначениеЗаполнено(Значение) Тогда Возврат ""; КонецЕсли;
	Попытка Возврат Строка(Значение.УникальныйИдентификатор()); Исключение Возврат Строка(Значение); КонецПопытки;
КонецФункции

Функция ПредставлениеБезMock(Значение)
	Если Не ЗначениеЗаполнено(Значение) Тогда Возврат ""; КонецЕсли;
	Возврат СтрЗаменить(Строка(Значение), "MOCK", "");
КонецФункции

Функция СформироватьDisplayName(СтрокаУслуги)
	Если Не ПустаяСтрока(СтрокаУслуги.tariff_name) И СтрНайти(ВРег(СтрокаУслуги.tariff_name), "РЭК") > 0 Тогда Возврат СтрокаУслуги.tariff_name; КонецЕсли;
	Если Не ПустаяСтрока(СтрокаУслуги.service_name) Тогда Возврат СтрокаУслуги.service_name; КонецЕсли;
	Если Не ПустаяСтрока(СтрокаУслуги.tariff_name) Тогда Возврат СтрокаУслуги.tariff_name; КонецЕсли;
	Если Не ПустаяСтрока(СтрокаУслуги.resource) Тогда Возврат СтрокаУслуги.resource; КонецЕсли;
	Возврат "Точка передачи показаний";
КонецФункции

Функция ПолучитьПоследнееПоказаниеПрибора(Прибор)
	Результат = Новый Структура("Показание,Дата", 0, "");
	Если Не ЗначениеЗаполнено(Прибор) Тогда
		Возврат Результат;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Показания.Показание КАК Показание, Показания.Период КАК Период ИЗ РегистрСведений.энргПоказанияПриборовУчета КАК Показания ГДЕ Показания.ПриборУчета = &Прибор УПОРЯДОЧИТЬ ПО Показания.Период УБЫВ");
	Запрос.УстановитьПараметр("Прибор", Прибор);
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Возврат Результат;
	КонецПопытки;
	Если Выборка.Следующий() Тогда
		Результат.Показание = Выборка.Показание; Результат.Дата = Формат(Выборка.Период, "ДФ=yyyy-MM-dd");
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ОпределитьРесурсПрибора(Прибор)
	Имя = ВРег(Строка(Прибор));
	Если СтрНайти(Имя, "ГВС") > 0 Тогда Возврат "ГВС"; КонецЕсли;
	Если СтрНайти(Имя, "ОТОП") > 0 Тогда Возврат "Отопление"; КонецЕсли;
	Если СтрНайти(Имя, "ЭЛЕКТ") > 0 Тогда Возврат "Электроэнергия"; КонецЕсли;
	Если СтрНайти(Имя, "ГАЗ") > 0 Тогда Возврат "Газ"; КонецЕсли;
	Возврат "ХВС";
КонецФункции

Функция СгенерироватьКодПодтверждения()
	Возврат Формат(1000 + (Секунда(ТекущаяДата()) * 137) % 9000, "ЧГ=0");
КонецФункции

Функция ХешСтроки(ИсходнаяСтрока) Экспорт

	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(ИсходнаяСтрока);

	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));

КонецФункции

Функция ПроверитьКодПривязки(MAXUserID, ЛицевойСчет, Код)
	Если MAXBotРазрешитьТестовыйКод() И Код = "1234" Тогда
		Возврат Истина;
	КонецЕсли;
	// TODO: проверить хеш, срок действия и счетчик попыток из MAXBotИсторияДанныхПользователей.
	Возврат Не ПустаяСтрока(Код);
КонецФункции

Функция ОшибкаНеРеализовано(Сообщение)
	Возврат Новый Структура("success,code,message,data", Ложь, "NOT_IMPLEMENTED", Сообщение, Новый Структура);
КонецФункции

Функция JSONСтрока(Данные)
	ЗаписьJSON = Новый ЗаписьJSON; ЗаписьJSON.УстановитьСтроку(); ЗаписатьJSON(ЗаписьJSON, Данные); Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция JSONВСтруктуру(СтрокаJSON)
	Если ПустаяСтрока(СтрокаJSON) Тогда Возврат Новый Структура; КонецЕсли;
	ЧтениеJSON = Новый ЧтениеJSON; ЧтениеJSON.УстановитьСтроку(СтрокаJSON); Возврат ПрочитатьJSON(ЧтениеJSON);
КонецФункции

#КонецОбласти
